<a href="https://colab.research.google.com/github/sam505/Machine_Learning/blob/master/UFO.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Import necessary python packages

In [ ]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LogisticRegression, RidgeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

## Read the csv dataset into the notebook and visualize

In [ ]:
# Reading the csv file using pandas' read_csv function that returns a dataframe object of the data in the csv
df = pd.read_csv("/content/drive/MyDrive/Data/county-data.csv") 

# Visualizes the first five and last five rows of the dataset
df

      subregion          region     pop  income   ipaddr  ufo2010
0     abbeville  south carolina   25101   34670    30330        2
1        acadia       louisiana   61912   37970    38203        6
2      accomack        virginia   33341   41595    41338        2
3           ada           idaho  409061   55304  1035427       59
4         adair            iowa    7481   47623     3762        0
...         ...             ...     ...     ...      ...      ...
3067       yuma         arizona  200022   41441    99991       53
3068       yuma        colorado   10119   44991     7662        1
3069     zapata           texas   14290   26009     3833        0
3070     zavala           texas   11961   23952      545        1
3071    ziebach    south dakota    2869   27917     1277        0

[3072 rows x 6 columns]

## Dataset summary

In [ ]:
# Describe function of the dataframe object of the dataset returns a statistical summary of the dataset columns
df.describe()

                pop         income        ipaddr      ufo2010
count  3.072000e+03    3072.000000  3.072000e+03  3072.000000
mean   1.010085e+05   45074.703451  3.879731e+05     7.943034
std    3.226042e+05   11551.981523  4.669809e+06    28.755570
min    7.100000e+01   19344.000000  0.000000e+00     0.000000
25%    1.121475e+04   37792.750000  5.367000e+03     0.000000
50%    2.604700e+04   43332.500000  1.528900e+04     2.000000
75%    6.792100e+04   50010.000000  6.259400e+04     6.000000
max    9.962789e+06  120096.000000  2.234410e+08   815.000000

## Check for missing values

In [ ]:
# The dataframe object's isna() function returns a False or True in case 
# a value is missing in any of the cells of a column. The sum() function in turn gives the total number of 
# Trues in each column. This values represent the number of all missing values in each column
df.isna().sum()

subregion    0
region       0
pop          0
income       0
ipaddr       0
ufo2010      0
dtype: int64

In [ ]:
new_df = df.reset_index()
new_df = new_df.set_index('region') # 2nd step
new_df = new_df.sum(level=['region'])

## Create new column

In [ ]:
df['region'].value_counts()

texas                   254
georgia                 159
kentucky                120
missouri                115
kansas                  105
illinois                102
virginia                100
north carolina          100
iowa                     99
tennessee                95
nebraska                 93
indiana                  92
ohio                     88
minnesota                87
michigan                 83
mississippi              82
oklahoma                 77
arkansas                 75
wisconsin                71
alabama                  67
pennsylvania             67
florida                  67
south dakota             66
louisiana                64
colorado                 63
new york                 62
california               58
montana                  56
west virginia            55
north dakota             53
south carolina           46
idaho                    44
washington               39
oregon                   36
new mexico               33
utah                     29
maryland                 24
wyoming                  23
new jersey               21
nevada                   17
maine                    16
massachusetts            14
vermont                  14
arizona                  14
new hampshire            10
connecticut               8
rhode island              5
delaware                  3
district of columbia      1
Name: region, dtype: int64

In [ ]:
df['subregion'].value_counts()

washington       32
jefferson        26
franklin         25
lincoln          24
jackson          24
                 ..
santa barbara     1
conway            1
addison           1
ventura           1
rio blanco        1
Name: subregion, Length: 1774, dtype: int64

In [ ]:
df.shape

(3072, 6)

In [ ]:
new_df['ufo_status'] = np.where(new_df['ufo2010'] > 333, 1, 0)
new_df.head()

                 index      pop   income    ipaddr  ufo2010  ufo_status
region
south carolina   56255  4723723  1793990   5256663      336           1
louisiana       105855  4601893  2636560   4666033      229           0
virginia        148204  6776755  5394332  48947094      506           1
idaho            50114  1595728  1904783   2148449      161           0
iowa            143826  3074186  4730381   4821849      243           0

In [ ]:
X = np.array([new_df["pop"], new_df["income"]])
Y = np.array(new_df["ufo_status"])
X = X.transpose(1, 0)
print(X.shape, Y.shape)

(49, 2) (49,)

In [ ]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.3)

In [ ]:
print(X_train.shape, X_test.shape, Y_train.shape, Y_test.shape)

(34, 2) (15, 2) (34,) (15,)

In [ ]:
model1 = LogisticRegression()
results = model1.fit(X_train, Y_train)
results

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
Y_Predict = model1.predict(X_test)
(Y_test == Y_Predict).mean() * 100

66.66666666666666

In [ ]:
model2 = KNeighborsClassifier(2)
model2.fit(X_train, Y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=2, p=2,
                     weights='uniform')

In [ ]:
Y_Predict = model2.predict(X_test)
(Y_test == Y_Predict).mean() * 100

86.66666666666667

In [ ]:
model3 = RidgeClassifier()
model3.fit(X_train, Y_train)

RidgeClassifier(alpha=1.0, class_weight=None, copy_X=True, fit_intercept=True,
                max_iter=None, normalize=False, random_state=None,
                solver='auto', tol=0.001)

In [ ]:
Y_Predict = model3.predict(X_test)
(Y_test == Y_Predict).mean() * 100

73.33333333333333